# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Sun Dec 28 17:58:38 PKT 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design top_wrapper

create_clock -name "clk" -period 20.0 -waveform {0.0 10.0} [get_pins clk_pad/XC]
set_clock_transition 0.2 [get_clocks clk]
set_load -pin_load 0.05 [get_ports cpu_resp_valid]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[31]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[30]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[29]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[28]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[27]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[26]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[25]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[24]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[23]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[22]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[21]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[20]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[19]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[18]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[17]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[16]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[15]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[14]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[13]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[12]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[11]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[10]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[9]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[8]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[7]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[6]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[5]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[4]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[3]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[2]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[1]}]
set_load -pin_load 0.05 [get_ports {cpu_resp_rdata[0]}]
set_load -pin_load 0.05 [get_ports mem_req_valid]
set_load -pin_load 0.05 [get_ports mem_req_rw]
set_load -pin_load 0.05 [get_ports {mem_req_addr[31]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[30]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[29]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[28]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[27]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[26]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[25]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[24]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[23]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[22]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[21]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[20]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[19]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[18]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[17]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[16]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[15]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[14]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[13]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[12]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[11]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[10]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[9]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[8]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[7]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[6]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[5]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[4]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[3]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[2]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[1]}]
set_load -pin_load 0.05 [get_ports {mem_req_addr[0]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[127]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[126]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[125]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[124]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[123]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[122]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[121]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[120]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[119]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[118]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[117]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[116]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[115]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[114]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[113]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[112]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[111]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[110]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[109]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[108]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[107]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[106]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[105]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[104]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[103]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[102]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[101]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[100]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[99]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[98]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[97]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[96]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[95]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[94]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[93]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[92]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[91]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[90]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[89]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[88]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[87]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[86]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[85]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[84]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[83]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[82]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[81]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[80]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[79]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[78]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[77]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[76]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[75]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[74]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[73]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[72]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[71]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[70]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[69]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[68]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[67]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[66]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[65]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[64]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[63]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[62]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[61]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[60]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[59]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[58]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[57]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[56]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[55]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[54]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[53]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[52]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[51]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[50]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[49]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[48]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[47]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[46]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[45]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[44]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[43]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[42]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[41]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[40]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[39]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[38]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[37]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[36]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[35]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[34]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[33]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[32]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[31]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[30]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[29]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[28]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[27]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[26]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[25]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[24]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[23]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[22]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[21]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[20]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[19]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[18]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[17]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[16]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[15]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[14]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[13]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[12]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[11]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[10]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[9]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[8]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[7]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[6]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[5]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[4]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[3]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[2]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[1]}]
set_load -pin_load 0.1 [get_ports {mem_req_wdata[0]}]
set_false_path -from [get_ports rst_n]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins cpu_req_valid_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins cpu_req_rw_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins cpu_addr_pad0/C]
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins cpu_wdata_pad0/C]
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins mem_resp_valid_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins mem_rdata_pad0/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins cpu_req_valid_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins cpu_req_rw_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins cpu_addr_pad0/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins cpu_wdata_pad0/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins mem_resp_valid_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins mem_rdata_pad0/C]
set_input_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins rst_pad/C]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins rst_pad/C]
set_output_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins cpu_resp_valid_pad/I]
set_output_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins cpu_resp_data_pad0/I]
set_output_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins mem_req_valid_pad/I]
set_output_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins mem_req_rw_pad/I]
set_output_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins mem_addr_pad0/I]
set_output_delay -clock [get_clocks clk] -add_delay -max 3.0 [get_pins mem_wdata_pad0/I]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins cpu_resp_valid_pad/I]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins cpu_resp_data_pad0/I]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins mem_req_valid_pad/I]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins mem_req_rw_pad/I]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins mem_addr_pad0/I]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.5 [get_pins mem_wdata_pad0/I]
set_wire_load_mode "segmented"
set_dont_use true [get_lib_cells tcbn65lptc/SDFCND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFCSNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKCSNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFKSNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCSND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCSND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCSND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNCSND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNSND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNSND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNSND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFNSND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFQND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSND0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSND1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSND2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSND4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFSNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXD4]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SDFXQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCND0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCND1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCND2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCND4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFCNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCND0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCND1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCND2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCND4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCNQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCNQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCNQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFKCNQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQND0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQND1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQND2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQND4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQNXD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQNXD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQNXD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQNXD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQXD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQXD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQXD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFQXD4]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFXD0]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFXD1]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFXD2]
set_dont_use true [get_lib_cells tcbn65lptc/SEDFXD4]
set_clock_uncertainty -setup 0.2 [get_clocks clk]
set_clock_uncertainty -hold 0.05 [get_clocks clk]
